src/geekbang-coolshell-index.org
#+title: 极客时间|左耳听风 文章目录
#+options: num:nil

** [[https://time.geekbang.org/column/article/181][开篇词  |  洞悉技术的本质，享受科技的乐趣]]

 “左耳朵耗子”陈皓，仅在小范围分享的独家秘籍。

** [[https://time.geekbang.org/column/article/183][01 | 程序员如何用技术变现（上）]]

 “手艺人”陈皓手把手教你如何通过自己的手艺“编程”变现。

** [[https://time.geekbang.org/column/article/185][02 | 程序员如何用技术变现（下）]]

 “手艺人”陈皓教你如何让自己的“手艺”更值钱。

** [[https://time.geekbang.org/column/article/281][03 | Equifax信息泄露始末]]

 解读Equifax大规模信息泄露始末，并从技术角度分析形成本次安全事件的原因。

** [[https://time.geekbang.org/column/article/285][04 | 从Equifax信息泄露看数据安全]]

 分析互联网时代的几次大规模数据泄露事件背后的原因，给出解决这类安全问题的技术手段和方法。

** [[https://time.geekbang.org/column/article/288][05 | 何为技术领导力]]

 技术领导力并不是一个职称，一个人事组织者，而是技术上的领先，技术上的优势。

** [[https://time.geekbang.org/column/article/291][06 | 如何拥有技术领导力]]

 吃透基础技术、提高学习能力、坚持做正确的事、高标准要求自己，不仅会让你全面提升技术技能，还能很好地锻炼自...

** [[https://time.geekbang.org/column/article/471][07 | 推荐阅读：每个程序员都该知道的事]]

 左耳朵耗子推荐的阅读列表，内容涵盖每一个技术人员都需要知道的东西，适合体系化学习和思考。

** [[https://time.geekbang.org/column/article/294][08 | Go语言，Docker和新技术]]

 学习关键新技术，收获最大的往往不仅是这些技术本身，而是可以了解一个技术的变迁和行业的发展。

** [[https://time.geekbang.org/column/article/540][09 | 答疑解惑：渴望、热情和选择]]

 尽量关注自己会得到的东西，而不是自己会失去的东西。因为无论你怎么选，你都会有得有失的。

** [[https://time.geekbang.org/column/article/297][10 | 如何成为一个大家愿意追随的Leader？]]

 做一个好的Leader真的不容易，需要强大和被人信赖，需要保持热情和朝气，需要带领团队守护理想，还需要直面困难...

** [[https://time.geekbang.org/column/article/675][11 | 程序中的错误处理：错误返回码和异常捕捉]]

 是返回错误状态，还是用异常捕捉的方式处理错误，不仅要结合使用场景来判断，还要从程序设计的角度进行思考。

** [[https://time.geekbang.org/column/article/693][12 | 程序中的错误处理：异步编程和最佳实践]]

 对于同一个地方不停的报错，最好不要都打到日志里。

** [[https://time.geekbang.org/column/article/730][13 | 魔数 0x5f3759df]]

 可能是编程世界里最经典的魔数的故事。

** [[https://time.geekbang.org/column/article/862][14 | 推荐阅读：机器学习101]]

 左耳朵耗子的机器学习入门“心法”及优质学习资源推荐。

** [[https://time.geekbang.org/column/article/995][15 | 时间管理：同扭曲时间的事儿抗争]]

 你要主动管理的不是你的时间，而是管理你的同事，管理你的信息。

** [[https://time.geekbang.org/column/article/997][16 | 时间管理：投资赚取时间]]

 其实，时间就像金钱一样，你得学会投资时间。把时间投资在有价值有意义的地方，你就会有更多的时间。

** [[https://time.geekbang.org/column/article/1059][17 | 故障处理最佳实践：应对故障]]

 出现故障时，最重要的不是debug故障，而是尽可能地减少故障的影响范围，并尽可能快地修复问题

** [[https://time.geekbang.org/column/article/1064][18 | 故障处理最佳实践：故障改进]]

 一个技术问题，后面隐藏的是工程能力问题，工程能力问题后面隐藏的是管理问题，管理问题后面隐藏的是一个公司文...

** [[https://time.geekbang.org/column/article/865][19 | 答疑解惑：我们应该能够识别的表象和本质]]

 兴趣只是开始，而能让人不断投入时间和精力的则是正反馈，是成就感。

** [[https://time.geekbang.org/column/article/1411][20 | 分布式系统架构的冰与火]]

 为什么需要分布式系统，而不是传统的单体架构。主要有两方面原因：增大系统容量和加强系统可用。

** [[https://time.geekbang.org/column/article/1505][21 | 从亚马逊的实践，谈分布式系统的难点]]

 构建分布式服务需要从组织，到软件工程，再到技术上的一次大的改造，需要比较长的时间来磨合和改进，并不断地总...

