html/geekbang-coolshell-index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>极客时间|左耳听风 文章目录</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">极客时间|左耳听风 文章目录</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf276ce3">开篇词  |  洞悉技术的本质，享受科技的乐趣</a></li>
<li><a href="#org3407219">01 | 程序员如何用技术变现（上）</a></li>
<li><a href="#org0e7dac6">02 | 程序员如何用技术变现（下）</a></li>
<li><a href="#org71d0992">03 | Equifax信息泄露始末</a></li>
<li><a href="#org7868ab9">04 | 从Equifax信息泄露看数据安全</a></li>
<li><a href="#org4f03316">05 | 何为技术领导力</a></li>
<li><a href="#org18770d9">06 | 如何拥有技术领导力</a></li>
<li><a href="#orgf57aea2">07 | 推荐阅读：每个程序员都该知道的事</a></li>
<li><a href="#orge74ca19">08 | Go语言，Docker和新技术</a></li>
<li><a href="#org4bee50e">09 | 答疑解惑：渴望、热情和选择</a></li>
<li><a href="#org859ce2a">10 | 如何成为一个大家愿意追随的Leader？</a></li>
<li><a href="#orgfbd4fd3">11 | 程序中的错误处理：错误返回码和异常捕捉</a></li>
<li><a href="#org41636ec">12 | 程序中的错误处理：异步编程和最佳实践</a></li>
<li><a href="#org669e3fe">13 | 魔数 0x5f3759df</a></li>
<li><a href="#org3011532">14 | 推荐阅读：机器学习101</a></li>
<li><a href="#org2b2ac51">15 | 时间管理：同扭曲时间的事儿抗争</a></li>
<li><a href="#orgd6dfa40">16 | 时间管理：投资赚取时间</a></li>
<li><a href="#org50e59d9">17 | 故障处理最佳实践：应对故障</a></li>
<li><a href="#orga2ce418">18 | 故障处理最佳实践：故障改进</a></li>
<li><a href="#org01b9055">19 | 答疑解惑：我们应该能够识别的表象和本质</a></li>
<li><a href="#orgf8039d7">20 | 分布式系统架构的冰与火</a></li>
<li><a href="#org9067c97">21 | 从亚马逊的实践，谈分布式系统的难点</a></li>
<li><a href="#orgad3929e">22 | 分布式系统的技术栈</a></li>
<li><a href="#orgbef5310">23 | 分布式系统关键技术：全栈监控</a></li>
<li><a href="#orgd450d71">24 | 分布式系统关键技术：服务调度</a></li>
<li><a href="#org21c6d45">25 | 分布式系统关键技术：流量与数据调度</a></li>
<li><a href="#orgde1df7e">26 | 洞悉PaaS平台的本质</a></li>
<li><a href="#org1b4ba82">27 | 推荐阅读：分布式系统架构经典资料</a></li>
<li><a href="#org9c95fd5">28 | 编程范式游记（1）- 起源</a></li>
<li><a href="#org31d418f">29 | 编程范式游记（2）- 泛型编程</a></li>
<li><a href="#orgb011aae">30 | 编程范式游记（3） - 类型系统和泛型的本质</a></li>
<li><a href="#org73ad8b3">31 | Git协同工作流，你该怎样选</a></li>
<li><a href="#orge928a29">32 | 推荐阅读：分布式数据调度相关论文</a></li>
<li><a href="#orgd153dd9">33 | 编程范式游记（4）- 函数式编程</a></li>
<li><a href="#org8cae293">34 | 编程范式游记（5）- 修饰器模式</a></li>
<li><a href="#orgb1b5837">35 | 编程范式游记（6）- 面向对象编程</a></li>
<li><a href="#org7680257">36 | 编程范式游记（7）- 基于原型的编程范式</a></li>
<li><a href="#org37b2f58">37 | 编程范式游记（8）- Go 语言的委托模式</a></li>
<li><a href="#orgcd3e763">38 | 编程范式游记（9）- 编程的本质</a></li>
<li><a href="#orgfd4adee">39 | 编程范式游记（10）- 逻辑编程范式</a></li>
<li><a href="#orgc227817">40 | 编程范式游记（11）- 程序世界里的编程范式</a></li>
<li><a href="#orge05353b">41 | 弹力设计篇之“认识故障和弹力设计”</a></li>
<li><a href="#orgc199715">42 | 弹力设计篇之“隔离设计”</a></li>
<li><a href="#org95de565">43 | 弹力设计篇之“异步通讯设计”</a></li>
<li><a href="#org1fca6c1">44 | 弹力设计篇之“幂等性设计”</a></li>
<li><a href="#org38c10f9">45 | 弹力设计篇之“服务的状态”</a></li>
<li><a href="#org5259a78">46 | 弹力设计篇之“补偿事务”</a></li>
<li><a href="#org98dcd3a">47 | 弹力设计篇之“重试设计”</a></li>
<li><a href="#org355f960">48 | 弹力设计篇之“熔断设计”</a></li>
<li><a href="#orgce7fe00">49 | 弹力设计篇之“限流设计”</a></li>
<li><a href="#orgfde9c16">50 | 弹力设计篇之“降级设计”</a></li>
<li><a href="#org0407c72">51 | 弹力设计篇之“弹力设计总结”</a></li>
<li><a href="#orgd088a99">52 | 区块链技术 - 区块链的革命性及技术概要</a></li>
<li><a href="#org3de5926">53 | 区块链技术 - 区块链技术细节 - 哈希算法</a></li>
<li><a href="#org0887b30">54 | 区块链技术 - 区块链技术细节 - 加密和挖矿</a></li>
<li><a href="#orgea64307">55 | 区块链技术 - 去中心化的共识机制</a></li>
<li><a href="#orga156c88">56 | 区块链技术 - 智能合约</a></li>
<li><a href="#orgf749e60">57 | 区块链技术 - 传统金融和虚拟货币</a></li>
<li><a href="#org0d5c4f2">58 | 管理设计篇之"分布式锁"</a></li>
<li><a href="#orga11fc71">59 | 管理设计篇之"配置中心"</a></li>
<li><a href="#org7d8bfbb">60 | 管理设计篇之"边车模式"</a></li>
<li><a href="#org9cc8322">61 | 管理设计篇之"服务网格"</a></li>
<li><a href="#orga5007b2">62 | 管理设计篇之"网关模式"</a></li>
<li><a href="#org2b06af3">63 | 管理设计篇之"部署升级策略"</a></li>
<li><a href="#org059748c">64 | 性能设计篇之"缓存"</a></li>
<li><a href="#org40ed66d">65 | 性能设计篇之"异步处理"</a></li>
<li><a href="#org264ce20">66 | 性能设计篇之"数据库扩展"</a></li>
<li><a href="#org81476f7">67 | 性能设计篇之"秒杀"</a></li>
<li><a href="#orge48a920">68 | 性能设计篇之"边缘计算"</a></li>
<li><a href="#orgcc89eac">69 | 程序员练级攻略（2018）：开篇词</a></li>
<li><a href="#org57d5ebd">70 | 程序员练级攻略（2018）：零基础启蒙</a></li>
<li><a href="#orgf3a19da">71 | 程序员练级攻略（2018）：正式入门</a></li>
<li><a href="#org880c1df">72 | 程序员练级攻略（2018）：程序员修养</a></li>
<li><a href="#org4cc96f1">73 | 程序员练级攻略（2018）：编程语言</a></li>
<li><a href="#orgaf4db1c">74 | 程序员练级攻略（2018）：理论学科</a></li>
<li><a href="#orgbccf42c">75 | 程序员练级攻略（2018）：系统知识</a></li>
<li><a href="#org7d6750a">76 | 程序员练级攻略（2018）：软件设计</a></li>
<li><a href="#orgec17e0c">77 | 程序员练级攻略（2018）：Linux系统、内存和网络</a></li>
<li><a href="#org0415307">78 | 程序员练级攻略（2018）：异步I/O模型和Lock-Free编程</a></li>
<li><a href="#orge9d8442">79 | 程序员练级攻略（2018）：Java底层知识</a></li>
<li><a href="#org54b55da">80 | 程序员练级攻略（2018）：数据库</a></li>
<li><a href="#org568cce3">81 | 程序员练级攻略（2018）：分布式架构入门</a></li>
<li><a href="#org6c055aa">82 | 程序员练级攻略（2018）：分布式架构经典图书和论文</a></li>
<li><a href="#org28a3b07">83 | 程序员练级攻略（2018）：分布式架构工程设计</a></li>
<li><a href="#org3799035">84 | 程序员练级攻略（2018）：微服务</a></li>
<li><a href="#org7597ab6">85 | 程序员练级攻略（2018）：容器化和自动化运维</a></li>
<li><a href="#org67191e7">86 | 程序员练级攻略（2018）：机器学习和人工智能</a></li>
<li><a href="#orga94e884">87 | 程序员练级攻略（2018）：前端基础和底层原理</a></li>
<li><a href="#orga8827db">88 | 程序员练级攻略（2018）：前端性能优化和框架</a></li>
<li><a href="#orgb1eb6a6">89 | 程序员练级攻略（2018）：UI/UX设计</a></li>
<li><a href="#orga2d4ab4">90 | 程序员练级攻略（2018）：技术资源集散地</a></li>
<li><a href="#org73b0e5b">91 | 程序员面试攻略：面试前的准备</a></li>
<li><a href="#org54bdf90">92 | 程序员面试攻略：面试中的技巧</a></li>
<li><a href="#org4c9a4d2">93 | 程序员面试攻略：面试风格</a></li>
<li><a href="#org258c066">94 | 程序员面试攻略：实力才是王中王</a></li>
<li><a href="#org4a72105">95 | 高效学习：端正学习态度</a></li>
<li><a href="#orgdd323dc">96 | 高效学习：源头、原理和知识地图</a></li>
<li><a href="#orga0f2b75">97 | 高效学习：深度，归纳和坚持实践</a></li>
<li><a href="#orgd27b776">98 | 高效学习：如何学习和阅读代码</a></li>
<li><a href="#orgca81d6b">99 | 高效学习：面对枯燥和量大的知识</a></li>
<li><a href="#org9cdface">100 | 高效沟通：Talk和Code同等重要</a></li>
<li><a href="#org3bfa2c8">101 | 高效沟通：沟通阻碍和应对方法</a></li>
<li><a href="#org804c1d2">102 | 高效沟通：沟通方式及技巧</a></li>
<li><a href="#org43b58c0">103 | 高效沟通：沟通技术</a></li>
<li><a href="#orgb32e560">104 | 高效沟通：好老板要善于提问</a></li>
<li><a href="#orgd206f4d">105 | 高效沟通：好好说话的艺术</a></li>
<li><a href="#org499c021">结束语 | 业精于勤，行成于思</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf276ce3" class="outline-2">
<h2 id="orgf276ce3"><a href="https://time.geekbang.org/column/article/181">开篇词  |  洞悉技术的本质，享受科技的乐趣</a></h2>
<div class="outline-text-2" id="text-orgf276ce3">
<p>
“左耳朵耗子”陈皓，仅在小范围分享的独家秘籍。
</p>
</div>
</div>

<div id="outline-container-org3407219" class="outline-2">
<h2 id="org3407219"><a href="https://time.geekbang.org/column/article/183">01 | 程序员如何用技术变现（上）</a></h2>
<div class="outline-text-2" id="text-org3407219">
<p>
“手艺人”陈皓手把手教你如何通过自己的手艺“编程”变现。
</p>
</div>
</div>

<div id="outline-container-org0e7dac6" class="outline-2">
<h2 id="org0e7dac6"><a href="https://time.geekbang.org/column/article/185">02 | 程序员如何用技术变现（下）</a></h2>
<div class="outline-text-2" id="text-org0e7dac6">
<p>
“手艺人”陈皓教你如何让自己的“手艺”更值钱。
</p>
</div>
</div>

<div id="outline-container-org71d0992" class="outline-2">
<h2 id="org71d0992"><a href="https://time.geekbang.org/column/article/281">03 | Equifax信息泄露始末</a></h2>
<div class="outline-text-2" id="text-org71d0992">
<p>
解读Equifax大规模信息泄露始末，并从技术角度分析形成本次安全事件的原因。
</p>
</div>
</div>

<div id="outline-container-org7868ab9" class="outline-2">
<h2 id="org7868ab9"><a href="https://time.geekbang.org/column/article/285">04 | 从Equifax信息泄露看数据安全</a></h2>
<div class="outline-text-2" id="text-org7868ab9">
<p>
分析互联网时代的几次大规模数据泄露事件背后的原因，给出解决这类安全问题的技术手段和方法。
</p>
</div>
</div>

<div id="outline-container-org4f03316" class="outline-2">
<h2 id="org4f03316"><a href="https://time.geekbang.org/column/article/288">05 | 何为技术领导力</a></h2>
<div class="outline-text-2" id="text-org4f03316">
<p>
技术领导力并不是一个职称，一个人事组织者，而是技术上的领先，技术上的优势。
</p>
</div>
</div>

<div id="outline-container-org18770d9" class="outline-2">
<h2 id="org18770d9"><a href="https://time.geekbang.org/column/article/291">06 | 如何拥有技术领导力</a></h2>
<div class="outline-text-2" id="text-org18770d9">
<p>
吃透基础技术、提高学习能力、坚持做正确的事、高标准要求自己，不仅会让你全面提升技术技能，还能很好地锻炼自&#x2026;
</p>
</div>
</div>

<div id="outline-container-orgf57aea2" class="outline-2">
<h2 id="orgf57aea2"><a href="https://time.geekbang.org/column/article/471">07 | 推荐阅读：每个程序员都该知道的事</a></h2>
<div class="outline-text-2" id="text-orgf57aea2">
<p>
左耳朵耗子推荐的阅读列表，内容涵盖每一个技术人员都需要知道的东西，适合体系化学习和思考。
</p>
</div>
</div>

<div id="outline-container-orge74ca19" class="outline-2">
<h2 id="orge74ca19"><a href="https://time.geekbang.org/column/article/294">08 | Go语言，Docker和新技术</a></h2>
<div class="outline-text-2" id="text-orge74ca19">
<p>
学习关键新技术，收获最大的往往不仅是这些技术本身，而是可以了解一个技术的变迁和行业的发展。
</p>
</div>
</div>

<div id="outline-container-org4bee50e" class="outline-2">
<h2 id="org4bee50e"><a href="https://time.geekbang.org/column/article/540">09 | 答疑解惑：渴望、热情和选择</a></h2>
<div class="outline-text-2" id="text-org4bee50e">
<p>
尽量关注自己会得到的东西，而不是自己会失去的东西。因为无论你怎么选，你都会有得有失的。
</p>
</div>
</div>

<div id="outline-container-org859ce2a" class="outline-2">
<h2 id="org859ce2a"><a href="https://time.geekbang.org/column/article/297">10 | 如何成为一个大家愿意追随的Leader？</a></h2>
<div class="outline-text-2" id="text-org859ce2a">
<p>
做一个好的Leader真的不容易，需要强大和被人信赖，需要保持热情和朝气，需要带领团队守护理想，还需要直面困难&#x2026;
</p>
</div>
</div>

<div id="outline-container-orgfbd4fd3" class="outline-2">
<h2 id="orgfbd4fd3"><a href="https://time.geekbang.org/column/article/675">11 | 程序中的错误处理：错误返回码和异常捕捉</a></h2>
<div class="outline-text-2" id="text-orgfbd4fd3">
<p>
是返回错误状态，还是用异常捕捉的方式处理错误，不仅要结合使用场景来判断，还要从程序设计的角度进行思考。
</p>
</div>
</div>

<div id="outline-container-org41636ec" class="outline-2">
<h2 id="org41636ec"><a href="https://time.geekbang.org/column/article/693">12 | 程序中的错误处理：异步编程和最佳实践</a></h2>
<div class="outline-text-2" id="text-org41636ec">
<p>
对于同一个地方不停的报错，最好不要都打到日志里。
</p>
</div>
</div>

<div id="outline-container-org669e3fe" class="outline-2">
<h2 id="org669e3fe"><a href="https://time.geekbang.org/column/article/730">13 | 魔数 0x5f3759df</a></h2>
<div class="outline-text-2" id="text-org669e3fe">
<p>
可能是编程世界里最经典的魔数的故事。
</p>
</div>
</div>

<div id="outline-container-org3011532" class="outline-2">
<h2 id="org3011532"><a href="https://time.geekbang.org/column/article/862">14 | 推荐阅读：机器学习101</a></h2>
<div class="outline-text-2" id="text-org3011532">
<p>
左耳朵耗子的机器学习入门“心法”及优质学习资源推荐。
</p>
</div>
</div>

<div id="outline-container-org2b2ac51" class="outline-2">
<h2 id="org2b2ac51"><a href="https://time.geekbang.org/column/article/995">15 | 时间管理：同扭曲时间的事儿抗争</a></h2>
<div class="outline-text-2" id="text-org2b2ac51">
<p>
你要主动管理的不是你的时间，而是管理你的同事，管理你的信息。
</p>
</div>
</div>

<div id="outline-container-orgd6dfa40" class="outline-2">
<h2 id="orgd6dfa40"><a href="https://time.geekbang.org/column/article/997">16 | 时间管理：投资赚取时间</a></h2>
<div class="outline-text-2" id="text-orgd6dfa40">
<p>
其实，时间就像金钱一样，你得学会投资时间。把时间投资在有价值有意义的地方，你就会有更多的时间。
</p>
</div>
</div>

<div id="outline-container-org50e59d9" class="outline-2">
<h2 id="org50e59d9"><a href="https://time.geekbang.org/column/article/1059">17 | 故障处理最佳实践：应对故障</a></h2>
<div class="outline-text-2" id="text-org50e59d9">
<p>
出现故障时，最重要的不是debug故障，而是尽可能地减少故障的影响范围，并尽可能快地修复问题
</p>
</div>
</div>

<div id="outline-container-orga2ce418" class="outline-2">
<h2 id="orga2ce418"><a href="https://time.geekbang.org/column/article/1064">18 | 故障处理最佳实践：故障改进</a></h2>
<div class="outline-text-2" id="text-orga2ce418">
<p>
一个技术问题，后面隐藏的是工程能力问题，工程能力问题后面隐藏的是管理问题，管理问题后面隐藏的是一个公司文&#x2026;
</p>
</div>
</div>

<div id="outline-container-org01b9055" class="outline-2">
<h2 id="org01b9055"><a href="https://time.geekbang.org/column/article/865">19 | 答疑解惑：我们应该能够识别的表象和本质</a></h2>
<div class="outline-text-2" id="text-org01b9055">
<p>
兴趣只是开始，而能让人不断投入时间和精力的则是正反馈，是成就感。
</p>
</div>
</div>

<div id="outline-container-orgf8039d7" class="outline-2">
<h2 id="orgf8039d7"><a href="https://time.geekbang.org/column/article/1411">20 | 分布式系统架构的冰与火</a></h2>
<div class="outline-text-2" id="text-orgf8039d7">
<p>
为什么需要分布式系统，而不是传统的单体架构。主要有两方面原因：增大系统容量和加强系统可用。
</p>
</div>
</div>

<div id="outline-container-org9067c97" class="outline-2">
<h2 id="org9067c97"><a href="https://time.geekbang.org/column/article/1505">21 | 从亚马逊的实践，谈分布式系统的难点</a></h2>
<div class="outline-text-2" id="text-org9067c97">
<p>
构建分布式服务需要从组织，到软件工程，再到技术上的一次大的改造，需要比较长的时间来磨合和改进，并不断地总&#x2026;
</p>
</div>
</div>
