html/geekbang-coolshell-index.html

<div id="outline-container-orgad3929e" class="outline-2">
<h2 id="orgad3929e"><a href="https://time.geekbang.org/column/article/1512">22 | 分布式系统的技术栈</a></h2>
<div class="outline-text-2" id="text-orgad3929e">
<p>
做分布式系统最大的坑就是，需要具备一个成本巨高无比的技术栈，看着就都头晕。要投入大量的人力、物力和时间才&#x2026;
</p>
</div>
</div>

<div id="outline-container-orgbef5310" class="outline-2">
<h2 id="orgbef5310"><a href="https://time.geekbang.org/column/article/1513">23 | 分布式系统关键技术：全栈监控</a></h2>
<div class="outline-text-2" id="text-orgbef5310">
<p>
全栈系统监控尤其重要，它就像是我们的眼睛，没有它，我们根本不知道系统到底发生了什么。
</p>
</div>
</div>

<div id="outline-container-orgd450d71" class="outline-2">
<h2 id="orgd450d71"><a href="https://time.geekbang.org/column/article/1604">24 | 分布式系统关键技术：服务调度</a></h2>
<div class="outline-text-2" id="text-orgd450d71">
<p>
微服务是服务依赖最优解的上限，而服务依赖的下限是千万不要有依赖环。
</p>
</div>
</div>

<div id="outline-container-org21c6d45" class="outline-2">
<h2 id="org21c6d45"><a href="https://time.geekbang.org/column/article/1609">25 | 分布式系统关键技术：流量与数据调度</a></h2>
<div class="outline-text-2" id="text-org21c6d45">
<p>
真正完整解决数据 Scale 问题的应该还是数据结点自身。
</p>
</div>
</div>

<div id="outline-container-orgde1df7e" class="outline-2">
<h2 id="orgde1df7e"><a href="https://time.geekbang.org/column/article/1610">26 | 洞悉PaaS平台的本质</a></h2>
<div class="outline-text-2" id="text-orgde1df7e">
<p>
一个好的 PaaS 平台应该具有分布式、服务化、自动化部署、高可用、敏捷以及分层开放的特征，并可与 IaaS 实&#x2026;
</p>
</div>
</div>

<div id="outline-container-org1b4ba82" class="outline-2">
<h2 id="org1b4ba82"><a href="https://time.geekbang.org/column/article/2080">27 | 推荐阅读：分布式系统架构经典资料</a></h2>
<div class="outline-text-2" id="text-org1b4ba82">
<p>
最赞的是，作者将各种各样的技术的本质非常好地关联在一起，帮你触类旁通。
</p>
</div>
</div>

<div id="outline-container-org9c95fd5" class="outline-2">
<h2 id="org9c95fd5"><a href="https://time.geekbang.org/column/article/301">28 | 编程范式游记（1）- 起源</a></h2>
<div class="outline-text-2" id="text-org9c95fd5">
<p>
《编程范式游记》系列文章，带你了解各主流编程语言的特性，更启发你深入理解编程的本质。
</p>
</div>
</div>

<div id="outline-container-org31d418f" class="outline-2">
<h2 id="org31d418f"><a href="https://time.geekbang.org/column/article/303">29 | 编程范式游记（2）- 泛型编程</a></h2>
<div class="outline-text-2" id="text-org31d418f">
<p>
C++语言是如何通过泛型来解决C语言遇到的问题的？
</p>
</div>
</div>

<div id="outline-container-orgb011aae" class="outline-2">
<h2 id="orgb011aae"><a href="https://time.geekbang.org/column/article/2017">30 | 编程范式游记（3） - 类型系统和泛型的本质</a></h2>
<div class="outline-text-2" id="text-orgb011aae">
<p>
泛型编程的本质是屏蔽掉数据和操作数据的细节，让算法更为通用，让编程者更多地关注算法的结构，而不是在算法中&#x2026;
</p>
</div>
</div>

<div id="outline-container-org73ad8b3" class="outline-2">
<h2 id="org73ad8b3"><a href="https://time.geekbang.org/column/article/2440">31 | Git协同工作流，你该怎样选</a></h2>
<div class="outline-text-2" id="text-org73ad8b3">
<p>
与其花时间在 Git 协同工作流上，还不如把时间花在调整软件架构和自动化软件生产和运维流程上来，这才是真正&#x2026;
</p>
</div>
</div>

<div id="outline-container-orge928a29" class="outline-2">
<h2 id="orge928a29"><a href="https://time.geekbang.org/column/article/2421">32 | 推荐阅读：分布式数据调度相关论文</a></h2>
<div class="outline-text-2" id="text-orge928a29">
<p>
这些论文和相关的工程实践以及开源项目，相信可以让你在细节方面对分布式中最难的一块——数据调度方面有更多的&#x2026;
</p>
</div>
</div>

<div id="outline-container-orgd153dd9" class="outline-2">
<h2 id="orgd153dd9"><a href="https://time.geekbang.org/column/article/2711">33 | 编程范式游记（4）- 函数式编程</a></h2>
<div class="outline-text-2" id="text-orgd153dd9">
<p>
函数式编程的核心思想是将运算过程尽量写成一系列嵌套的函数调用，关注的是做什么而不是怎么做。
</p>
</div>
</div>

<div id="outline-container-org8cae293" class="outline-2">
<h2 id="org8cae293"><a href="https://time.geekbang.org/column/article/2723">34 | 编程范式游记（5）- 修饰器模式</a></h2>
<div class="outline-text-2" id="text-org8cae293">
<p>
以Python和Go的Decorator为例，讲述Decorator是如何工作的？
</p>
</div>
</div>

<div id="outline-container-orgb1b5837" class="outline-2">
<h2 id="orgb1b5837"><a href="https://time.geekbang.org/column/article/2729">35 | 编程范式游记（6）- 面向对象编程</a></h2>
<div class="outline-text-2" id="text-orgb1b5837">
<p>
面向对象程序设计可以看作一种在程序中包含各种独立而又互相调用的对象的思想，这与传统的思想刚好相反。
</p>
</div>
</div>

<div id="outline-container-org7680257" class="outline-2">
<h2 id="org7680257"><a href="https://time.geekbang.org/column/article/2741">36 | 编程范式游记（7）- 基于原型的编程范式</a></h2>
<div class="outline-text-2" id="text-org7680257">
<p>
基于原型的编程其实也是面向对象编程的一种方式。没有 class 化的，直接使用对象。
</p>
</div>
</div>

<div id="outline-container-org37b2f58" class="outline-2">
<h2 id="org37b2f58"><a href="https://time.geekbang.org/column/article/2748">37 | 编程范式游记（8）- Go 语言的委托模式</a></h2>
<div class="outline-text-2" id="text-org37b2f58">
<p>
Go通过委托扩展原有的功能，不关心里面的数据类型。
</p>
</div>
</div>

<div id="outline-container-orgcd3e763" class="outline-2">
<h2 id="orgcd3e763"><a href="https://time.geekbang.org/column/article/2751">38 | 编程范式游记（9）- 编程的本质</a></h2>
<div class="outline-text-2" id="text-orgcd3e763">
<p>
绝大多数程序复杂混乱的根本原因：业务逻辑与控制逻辑的耦合。
</p>
</div>
</div>

<div id="outline-container-orgfd4adee" class="outline-2">
<h2 id="orgfd4adee"><a href="https://time.geekbang.org/column/article/2752">39 | 编程范式游记（10）- 逻辑编程范式</a></h2>
<div class="outline-text-2" id="text-orgfd4adee">
<p>
逻辑编程的要点是将正规的逻辑风格带入计算机程序设计之中。
</p>
</div>
</div>

<div id="outline-container-orgc227817" class="outline-2">
<h2 id="orgc227817"><a href="https://time.geekbang.org/column/article/2754">40 | 编程范式游记（11）- 程序世界里的编程范式</a></h2>
<div class="outline-text-2" id="text-orgc227817">
<p>
既然函数式编程这么好，为什么函数式编程火不起来呢？
</p>
</div>
</div>

<div id="outline-container-orge05353b" class="outline-2">
<h2 id="orge05353b"><a href="https://time.geekbang.org/column/article/3912">41 | 弹力设计篇之“认识故障和弹力设计”</a></h2>
<div class="outline-text-2" id="text-orge05353b">
<p>
在确保系统正确性的前提下，系统的可用性是弹力设计保障的重点。
</p>
</div>
</div>

<div id="outline-container-orgc199715" class="outline-2">
<h2 id="orgc199715"><a href="https://time.geekbang.org/column/article/3917">42 | 弹力设计篇之“隔离设计”</a></h2>
<div class="outline-text-2" id="text-orgc199715">
<p>
软件设计当然也“漏水”，所以为了不让这个“故障”蔓延开来，需要使用“隔板”技术，来将架构分隔成多个“船舱&#x2026;
</p>
</div>
</div>

<div id="outline-container-org95de565" class="outline-2">
<h2 id="org95de565"><a href="https://time.geekbang.org/column/article/3926">43 | 弹力设计篇之“异步通讯设计”</a></h2>
<div class="outline-text-2" id="text-org95de565">
<p>
异步通讯最重要的是解耦服务间的依赖。最佳解耦的方式是通过Broker的机制。
</p>
</div>
</div>

<div id="outline-container-org1fca6c1" class="outline-2">
<h2 id="org1fca6c1"><a href="https://time.geekbang.org/column/article/4050">44 | 弹力设计篇之“幂等性设计”</a></h2>
<div class="outline-text-2" id="text-org1fca6c1">
<p>
幂等性的含义是，一个调用被发送多次所产生的总的副作用和被发送一次所产生的副作用是一样的。而服务调用有三种&#x2026;
</p>
</div>
</div>

<div id="outline-container-org38c10f9" class="outline-2">
<h2 id="org38c10f9"><a href="https://time.geekbang.org/column/article/4086">45 | 弹力设计篇之“服务的状态”</a></h2>
<div class="outline-text-2" id="text-org38c10f9">
<p>
在容错设计中，服务状态是非常复杂的。尤其对于运维来说，要调度服务就要调度服务的状态，迁移服务的状态就需要&#x2026;
</p>
</div>
</div>

<div id="outline-container-org5259a78" class="outline-2">
<h2 id="org5259a78"><a href="https://time.geekbang.org/column/article/4087">46 | 弹力设计篇之“补偿事务”</a></h2>
<div class="outline-text-2" id="text-org5259a78">
<p>
业务补偿主要做两件事：第一，努力将一个业务流程执行完成；第二，如果执行不下去，需要启动补偿机制，回滚业务&#x2026;
</p>
</div>
</div>

<div id="outline-container-org98dcd3a" class="outline-2">
<h2 id="org98dcd3a"><a href="https://time.geekbang.org/column/article/4121">47 | 弹力设计篇之“重试设计”</a></h2>
<div class="outline-text-2" id="text-org98dcd3a">
<p>
" 重试 " 的语义是，我们认为这个故障是暂时的，而不是永久的，所以，我们会去重试。
</p>
</div>
</div>

<div id="outline-container-org355f960" class="outline-2">
<h2 id="org355f960"><a href="https://time.geekbang.org/column/article/4241">48 | 弹力设计篇之“熔断设计”</a></h2>
<div class="outline-text-2" id="text-org355f960">
<p>
前面说过重试机制，如果错误太多，或是在短时间内得不到修复，那么重试就没有意义了，此时应该开启熔断操作。尤&#x2026;
</p>
</div>
</div>

<div id="outline-container-orgce7fe00" class="outline-2">
<h2 id="orgce7fe00"><a href="https://time.geekbang.org/column/article/4245">49 | 弹力设计篇之“限流设计”</a></h2>
<div class="outline-text-2" id="text-orgce7fe00">
<p>
如何用限流设计确保系统不会在过载的情况下导致问题？
</p>
</div>
</div>

<div id="outline-container-orgfde9c16" class="outline-2">
<h2 id="orgfde9c16"><a href="https://time.geekbang.org/column/article/4252">50 | 弹力设计篇之“降级设计”</a></h2>
<div class="outline-text-2" id="text-orgfde9c16">
<p>
降级设计的本质是解决资源不足和访问量过大的问题。
</p>
</div>
</div>

<div id="outline-container-org0407c72" class="outline-2">
<h2 id="org0407c72"><a href="https://time.geekbang.org/column/article/4253">51 | 弹力设计篇之“弹力设计总结”</a></h2>
<div class="outline-text-2" id="text-org0407c72">
<p>
这篇文章中有弹力设计总图，带你将各种弹力设计模式融会贯通，并且介绍了分布式系统开发和运维实践。
</p>
</div>
</div>

<div id="outline-container-orgd088a99" class="outline-2">
<h2 id="orgd088a99"><a href="https://time.geekbang.org/column/article/5197">52 | 区块链技术 - 区块链的革命性及技术概要</a></h2>
<div class="outline-text-2" id="text-orgd088a99">
<p>
真正让区块链做到非常难篡改的是工作量证明的共识机制。
</p>
</div>
</div>

<div id="outline-container-org3de5926" class="outline-2">
<h2 id="org3de5926"><a href="https://time.geekbang.org/column/article/5363">53 | 区块链技术 - 区块链技术细节 - 哈希算法</a></h2>
<div class="outline-text-2" id="text-org3de5926">
<p>
哈希算法极大程度地解决了区块链中交易信息不能被篡改的问题。
</p>
</div>
</div>

<div id="outline-container-org0887b30" class="outline-2">
<h2 id="org0887b30"><a href="https://time.geekbang.org/column/article/5438">54 | 区块链技术 - 区块链技术细节 - 加密和挖矿</a></h2>
<div class="outline-text-2" id="text-org0887b30">
<p>
为了保证每10分钟产生一个区块，当算力不足的时候，挖矿难度下降，当算力充足的时候，难度提高。
</p>
</div>
</div>

<div id="outline-container-orgea64307" class="outline-2">
<h2 id="orgea64307"><a href="https://time.geekbang.org/column/article/5612">55 | 区块链技术 - 去中心化的共识机制</a></h2>
<div class="outline-text-2" id="text-orgea64307">
<p>
PoW（工作量证明机制）让整个去中心化系统的一致性，不再以人数多认可的数据为准，而是以算力多的人认可的数据&#x2026;
</p>
</div>
</div>

<div id="outline-container-orga156c88" class="outline-2">
<h2 id="orga156c88"><a href="https://time.geekbang.org/column/article/5623">56 | 区块链技术 - 智能合约</a></h2>
<div class="outline-text-2" id="text-orga156c88">
<p>
以太坊的智能合约其实就是一段可执行的程序片段。看来，我程序员离统治世界又进了一步。
</p>
</div>
</div>

<div id="outline-container-orgf749e60" class="outline-2">
<h2 id="orgf749e60"><a href="https://time.geekbang.org/column/article/5636">57 | 区块链技术 - 传统金融和虚拟货币</a></h2>
<div class="outline-text-2" id="text-orgf749e60">
<p>
去中心化就是好吗？我们不需要权威机构了吗？技术可以解决信任问题吗？
</p>
</div>
</div>

<div id="outline-container-org0d5c4f2" class="outline-2">
<h2 id="org0d5c4f2"><a href="https://time.geekbang.org/column/article/5175">58 | 管理设计篇之"分布式锁"</a></h2>
<div class="outline-text-2" id="text-org0d5c4f2">
<p>
分布式锁服务应该是高可用的，而且是需要持久化的。
</p>
</div>
</div>

<div id="outline-container-orga11fc71" class="outline-2">
<h2 id="orga11fc71"><a href="https://time.geekbang.org/column/article/5819">59 | 管理设计篇之"配置中心"</a></h2>
<div class="outline-text-2" id="text-orga11fc71">
<p>
配置中心的设计重点应该放在如何统一和标准化软件的配置项，还会涉及软件版本、运行环境、平台、中间件等一系列&#x2026;
</p>
</div>
</div>

<div id="outline-container-org7d8bfbb" class="outline-2">
<h2 id="org7d8bfbb"><a href="https://time.geekbang.org/column/article/5909">60 | 管理设计篇之"边车模式"</a></h2>
<div class="outline-text-2" id="text-org7d8bfbb">
<p>
边车模式重点要解决控制和逻辑的分离，以及服务调用中上下文的问题。
</p>
</div>
</div>
