html/geekbang-coolshell-index.html

<div id="outline-container-org9cc8322" class="outline-2">
<h2 id="org9cc8322"><a href="https://time.geekbang.org/column/article/5920">61 | 管理设计篇之"服务网格"</a></h2>
<div class="outline-text-2" id="text-org9cc8322">
<p>
在工程中，Service Mesh 基本来说是一组轻量级的服务代理和应用逻辑的服务在一起，并且对于应用服务是透明的&#x2026;
</p>
</div>
</div>

<div id="outline-container-orga5007b2" class="outline-2">
<h2 id="orga5007b2"><a href="https://time.geekbang.org/column/article/6086">62 | 管理设计篇之"网关模式"</a></h2>
<div class="outline-text-2" id="text-orga5007b2">
<p>
网关模式可以细到为每个服务的实例配置上一个自己的 Gateway，也可以粗到为一组服务配置一个，甚至粗到为整个&#x2026;
</p>
</div>
</div>

<div id="outline-container-org2b06af3" class="outline-2">
<h2 id="org2b06af3"><a href="https://time.geekbang.org/column/article/6283">63 | 管理设计篇之"部署升级策略"</a></h2>
<div class="outline-text-2" id="text-org2b06af3">
<p>
本文讲述了停机、蓝绿、滚动、灰度和AB测试等部署升级策略的含义和优缺点，并放在一起进行了比较，给出了其各自&#x2026;
</p>
</div>
</div>

<div id="outline-container-org059748c" class="outline-2">
<h2 id="org059748c"><a href="https://time.geekbang.org/column/article/6282">64 | 性能设计篇之"缓存"</a></h2>
<div class="outline-text-2" id="text-org059748c">
<p>
缓存设计的重点，除了性能之外，在分布式架构下和公网环境下，对缓存集群、一致性、LRU的锁竞争、爬虫等多方面&#x2026;
</p>
</div>
</div>

<div id="outline-container-org40ed66d" class="outline-2">
<h2 id="org40ed66d"><a href="https://time.geekbang.org/column/article/7036">65 | 性能设计篇之"异步处理"</a></h2>
<div class="outline-text-2" id="text-org40ed66d">
<p>
异步系统所带来的好处是让我们的系统可以统一调度。
</p>
</div>
</div>

<div id="outline-container-org264ce20" class="outline-2">
<h2 id="org264ce20"><a href="https://time.geekbang.org/column/article/7045">66 | 性能设计篇之"数据库扩展"</a></h2>
<div class="outline-text-2" id="text-org264ce20">
<p>
请不要走哈希散列的分片方式，除非有个人拿着把刀把你逼到墙角，你马上就有生命危险。
</p>
</div>
</div>

<div id="outline-container-org81476f7" class="outline-2">
<h2 id="org81476f7"><a href="https://time.geekbang.org/column/article/7047">67 | 性能设计篇之"秒杀"</a></h2>
<div class="outline-text-2" id="text-org81476f7">
<p>
解决秒杀这种特定业务场景，可以使用 CDN 的边缘结点来扛流量，然后过滤用户请求，来保护数据中心的系统。
</p>
</div>
</div>

<div id="outline-container-orge48a920" class="outline-2">
<h2 id="orge48a920"><a href="https://time.geekbang.org/column/article/7086">68 | 性能设计篇之"边缘计算"</a></h2>
<div class="outline-text-2" id="text-orge48a920">
<p>
数据量越来越大，分析结果的速度需要越来越快，这两个需求，只会把我们逼到边缘计算上去。
</p>
</div>
</div>

<div id="outline-container-orgcc89eac" class="outline-2">
<h2 id="orgcc89eac"><a href="https://time.geekbang.org/column/article/8136">69 | 程序员练级攻略（2018）：开篇词</a></h2>
<div class="outline-text-2" id="text-orgcc89eac">
<p>
《程序员练级攻略（2018）》中的内容会更多也更专业，涵盖入门、程序员修养、专业基础、软件设计、高手成长等五&#x2026;
</p>
</div>
</div>

<div id="outline-container-org57d5ebd" class="outline-2">
<h2 id="org57d5ebd"><a href="https://time.geekbang.org/column/article/8216">70 | 程序员练级攻略（2018）：零基础启蒙</a></h2>
<div class="outline-text-2" id="text-org57d5ebd">
<p>
推荐Python和JavaScript作为入门语言，让你尽快上手，获得成就感。随后介绍了Linux操作系统、VS Code编程工具&#x2026;
</p>
</div>
</div>

<div id="outline-container-orgf3a19da" class="outline-2">
<h2 id="orgf3a19da"><a href="https://time.geekbang.org/column/article/8217">71 | 程序员练级攻略（2018）：正式入门</a></h2>
<div class="outline-text-2" id="text-orgf3a19da">
<p>
正式入门，我推荐编程语言里综合实力最强的Java，随后推荐了更为专业使用的编程工具，如编程的IDE、版本管理工&#x2026;
</p>
</div>
</div>

<div id="outline-container-org880c1df" class="outline-2">
<h2 id="org880c1df"><a href="https://time.geekbang.org/column/article/8700">72 | 程序员练级攻略（2018）：程序员修养</a></h2>
<div class="outline-text-2" id="text-org880c1df">
<p>
有修养的程序员才可能成长为真正的工程师和架构师，而没有修养的程序员只能沦为码农。
</p>
</div>
</div>

<div id="outline-container-org4cc96f1" class="outline-2">
<h2 id="org4cc96f1"><a href="https://time.geekbang.org/column/article/8701">73 | 程序员练级攻略（2018）：编程语言</a></h2>
<div class="outline-text-2" id="text-org4cc96f1">
<p>
一个合格的程序员应该掌握几门语言，不仅会让你对不同的语言进行比较，让你有更多的思考，而且也是一种学习能力&#x2026;
</p>
</div>
</div>

<div id="outline-container-orgaf4db1c" class="outline-2">
<h2 id="orgaf4db1c"><a href="https://time.geekbang.org/column/article/8887">74 | 程序员练级攻略（2018）：理论学科</a></h2>
<div class="outline-text-2" id="text-orgaf4db1c">
<p>
这些理论知识可以说是计算机科学这门学科最精华的知识了，认真学习，理解其背后的逻辑和思维方式，会令你受益匪&#x2026;
</p>
</div>
</div>

<div id="outline-container-orgbccf42c" class="outline-2">
<h2 id="orgbccf42c"><a href="https://time.geekbang.org/column/article/8888">75 | 程序员练级攻略（2018）：系统知识</a></h2>
<div class="outline-text-2" id="text-orgbccf42c">
<p>
你至少要掌握三个系统的基础知识——操作系统，网络系统和数据库系统，它们分别代表着计算机基础构架的三大件—&#x2026;
</p>
</div>
</div>

<div id="outline-container-org7d6750a" class="outline-2">
<h2 id="org7d6750a"><a href="https://time.geekbang.org/column/article/9369">76 | 程序员练级攻略（2018）：软件设计</a></h2>
<div class="outline-text-2" id="text-org7d6750a">
<p>
Linus 说过，这世界程序员之所有高下之分，最大的区别就是程序员的“品味”不一样。而对软件设计的学习是提高&#x2026;
</p>
</div>
</div>

<div id="outline-container-orgec17e0c" class="outline-2">
<h2 id="orgec17e0c"><a href="https://time.geekbang.org/column/article/9759">77 | 程序员练级攻略（2018）：Linux系统、内存和网络</a></h2>
<div class="outline-text-2" id="text-orgec17e0c">
<p>
你只需要日进一步，3-5 年后，你就会发现，绝大多数人都在你身后很远的地方了。
</p>
</div>
</div>

<div id="outline-container-org0415307" class="outline-2">
<h2 id="org0415307"><a href="https://time.geekbang.org/column/article/9851">78 | 程序员练级攻略（2018）：异步I/O模型和Lock-Free编程</a></h2>
<div class="outline-text-2" id="text-org0415307">
<p>
如果想开发出一个高性能的程序，你非常有必要学习 Lock-Free 的编程方式。
</p>
</div>
</div>

<div id="outline-container-orge9d8442" class="outline-2">
<h2 id="orge9d8442"><a href="https://time.geekbang.org/column/article/10216">79 | 程序员练级攻略（2018）：Java底层知识</a></h2>
<div class="outline-text-2" id="text-orge9d8442">
<p>
Java最黑科技的玩法是字节码编程，从而使得Java这门静态语言在运行时可以进行各种动态的代码修改。
</p>
</div>
</div>

<div id="outline-container-org54b55da" class="outline-2">
<h2 id="org54b55da"><a href="https://time.geekbang.org/column/article/10301">80 | 程序员练级攻略（2018）：数据库</a></h2>
<div class="outline-text-2" id="text-org54b55da">
<p>
数据是整个系统中关键中的关键，程序员不仅需要设计数据模型，还要保证整体系统的稳定性和可用性，所以作为程序&#x2026;
</p>
</div>
</div>

<div id="outline-container-org568cce3" class="outline-2">
<h2 id="org568cce3"><a href="https://time.geekbang.org/column/article/10603">81 | 程序员练级攻略（2018）：分布式架构入门</a></h2>
<div class="outline-text-2" id="text-org568cce3">
<p>
本文中推荐的资料基本涵盖了所有与系统架构相关的技术，足够这世上90%以上的公司用了，只有超级巨型的公司才有&#x2026;
</p>
</div>
</div>

<div id="outline-container-org6c055aa" class="outline-2">
<h2 id="org6c055aa"><a href="https://time.geekbang.org/column/article/10604">82 | 程序员练级攻略（2018）：分布式架构经典图书和论文</a></h2>
<div class="outline-text-2" id="text-org6c055aa">
<p>
分布式架构方面的经典图书和论文，涵盖了分布式系统架构方面的所有关键的理论知识，非常重要，请一定要认真学习&#x2026;
</p>
</div>
</div>

<div id="outline-container-org28a3b07" class="outline-2">
<h2 id="org28a3b07"><a href="https://time.geekbang.org/column/article/11232">83 | 程序员练级攻略（2018）：分布式架构工程设计</a></h2>
<div class="outline-text-2" id="text-org28a3b07">
<p>
要学好分布式架构，首先需要学习一些架构指导性的文章和方法论，即分布式架构设计原则。
</p>
</div>
</div>

<div id="outline-container-org3799035" class="outline-2">
<h2 id="org3799035"><a href="https://time.geekbang.org/column/article/11116">84 | 程序员练级攻略（2018）：微服务</a></h2>
<div class="outline-text-2" id="text-org3799035">
<p>
微服务中有很多很不错的想法和理念，所以学习微服务是每一个技术人员迈向卓越的架构师的必经之路。
</p>
</div>
</div>

<div id="outline-container-org7597ab6" class="outline-2">
<h2 id="org7597ab6"><a href="https://time.geekbang.org/column/article/11665">85 | 程序员练级攻略（2018）：容器化和自动化运维</a></h2>
<div class="outline-text-2" id="text-org7597ab6">
<p>
Docker和Kubernetes已经是分布式架构和自动化运维的必需品了，虽然玩法和传统运维不一样，但技术上并不复杂，只&#x2026;
</p>
</div>
</div>

<div id="outline-container-org67191e7" class="outline-2">
<h2 id="org67191e7"><a href="https://time.geekbang.org/column/article/11669">86 | 程序员练级攻略（2018）：机器学习和人工智能</a></h2>
<div class="outline-text-2" id="text-org67191e7">
<p>
这篇文章主要给了一些基础性的知识，包括基本原理、图书、课程、文章和相关算法。你顺着我画的这路走，成为一个&#x2026;
</p>
</div>
</div>

<div id="outline-container-orga94e884" class="outline-2">
<h2 id="orga94e884"><a href="https://time.geekbang.org/column/article/12271">87 | 程序员练级攻略（2018）：前端基础和底层原理</a></h2>
<div class="outline-text-2" id="text-orga94e884">
<p>
本文主要讲述了HTML5、CSS3和JavaScript（ES6）这三大基础核心，并推荐学习浏览器原理和网络协议等基本原理。
</p>
</div>
</div>

<div id="outline-container-orga8827db" class="outline-2">
<h2 id="orga8827db"><a href="https://time.geekbang.org/column/article/12389">88 | 程序员练级攻略（2018）：前端性能优化和框架</a></h2>
<div class="outline-text-2" id="text-orga8827db">
<p>
React.js使用函数式编程方式，更加符合后端程序员的思路，而Vue是更符合前端工程师习惯的框架。
</p>
</div>
</div>

<div id="outline-container-orgb1eb6a6" class="outline-2">
<h2 id="orgb1eb6a6"><a href="https://time.geekbang.org/column/article/12486">89 | 程序员练级攻略（2018）：UI/UX设计</a></h2>
<div class="outline-text-2" id="text-orgb1eb6a6">
<p>
我并不认为UI/UX设计这些内容只是设计师要学习的，如果你要成为一个前端程序员，那么学习这些设计上的东西可以&#x2026;
</p>
</div>
</div>

<div id="outline-container-orga2d4ab4" class="outline-2">
<h2 id="orga2d4ab4"><a href="https://time.geekbang.org/column/article/12561">90 | 程序员练级攻略（2018）：技术资源集散地</a></h2>
<div class="outline-text-2" id="text-orga2d4ab4">
<p>
学习需要自我驱动，要学会自己“找食物”，而不是“等着喂”。《程序员练级攻略》只是一个起点，引发你去走更远&#x2026;
</p>
</div>
</div>

<div id="outline-container-org73b0e5b" class="outline-2">
<h2 id="org73b0e5b"><a href="https://time.geekbang.org/column/article/13067">91 | 程序员面试攻略：面试前的准备</a></h2>
<div class="outline-text-2" id="text-org73b0e5b">
<p>
简历上的信息不要写太多，信息太多相当于没有信息，不要单纯地罗列，要突出自己的长处和技能。
</p>
</div>
</div>

<div id="outline-container-org54bdf90" class="outline-2">
<h2 id="org54bdf90"><a href="https://time.geekbang.org/column/article/13069">92 | 程序员面试攻略：面试中的技巧</a></h2>
<div class="outline-text-2" id="text-org54bdf90">
<p>
面试中有一些问题很难，但不要放弃。很多时候，面试官只是想看一下你的态度和思维方式。只要你能证明自己解决问&#x2026;
</p>
</div>
</div>

<div id="outline-container-org4c9a4d2" class="outline-2">
<h2 id="org4c9a4d2"><a href="https://time.geekbang.org/column/article/13191">93 | 程序员面试攻略：面试风格</a></h2>
<div class="outline-text-2" id="text-org4c9a4d2">
<p>
有些面试官会从一个简单的编码题开始，然后不断地加需求或是改需求。这时，你不要马上实现新的需求，而是停下来&#x2026;
</p>
</div>
</div>

<div id="outline-container-org258c066" class="outline-2">
<h2 id="org258c066"><a href="https://time.geekbang.org/column/article/13192">94 | 程序员面试攻略：实力才是王中王</a></h2>
<div class="outline-text-2" id="text-org258c066">
<p>
实力才是王中王，想成功进入BAT，拿到年薪30万、50万、60万的岗位，其实并没有你想的那么难。
</p>
</div>
</div>

<div id="outline-container-org4a72105" class="outline-2">
<h2 id="org4a72105"><a href="https://time.geekbang.org/column/article/14271">95 | 高效学习：端正学习态度</a></h2>
<div class="outline-text-2" id="text-org4a72105">
<p>
如果你不能克服自己DNA中的弱点，不能端正自己的态度，不能自律，不能坚持，不能举一反三，不能不断追问等，那&#x2026;
</p>
</div>
</div>

<div id="outline-container-orgdd323dc" class="outline-2">
<h2 id="orgdd323dc"><a href="https://time.geekbang.org/column/article/14321">96 | 高效学习：源头、原理和知识地图</a></h2>
<div class="outline-text-2" id="text-orgdd323dc">
<p>
学习并不是为了要记忆那些知识点，而是为了要找到一个知识的地图，你在这个地图上能通过关键路径找到你想要的答&#x2026;
</p>
</div>
</div>

<div id="outline-container-orga0f2b75" class="outline-2">
<h2 id="orga0f2b75"><a href="https://time.geekbang.org/column/article/14360">97 | 高效学习：深度，归纳和坚持实践</a></h2>
<div class="outline-text-2" id="text-orga0f2b75">
<p>
学习的开始阶段，可以不急于总结归纳，不急于下判断，做结论，而应该保留部分知识的不确定性，保持对知识的开放&#x2026;
</p>
</div>
</div>
