src/geekbang-coolshell-index.org
** [[https://time.geekbang.org/column/article/14380][98 | 高效学习：如何学习和阅读代码]]

 如果想了解思想、方法和原理，读书和读文档会更有效率；如果想知道具体细节，还是应该读代码。

** [[https://time.geekbang.org/column/article/14389][99 | 高效学习：面对枯燥和量大的知识]]

 面对如此量大的知识，你一定不要学在表面上，一定要学到本质上、原理上，一定要学那些不容易改变，能经得住时间...

** [[https://time.geekbang.org/column/article/28550][100 | 高效沟通：Talk和Code同等重要]]

 学习能力能让你的根越扎越深，无论遇到什么狂风暴雨，你都可以屹立不倒，而沟通能力则是树杆和枝叶，它们能让你...

** [[https://time.geekbang.org/column/article/32619][101 | 高效沟通：沟通阻碍和应对方法]]

 不要绕弯子，有话直说，这是最高效的沟通方式，既是对对方的一种信任，也是一种对自己的尊重，而且事情往往能得...

** [[https://time.geekbang.org/column/article/32796][102 | 高效沟通：沟通方式及技巧]]

 知道自己要什么和不要什么，你才会表现出有力量的观点和话语。而这些被强化过的观点和话语，只需要一句，就会在...

** [[https://time.geekbang.org/column/article/32902][103 | 高效沟通：沟通技术]]

 在和人争论时，如果要反驳，那一定要低维度反驳，越细节越好。而在说服对方时，则要在高维度说服对方，越宏观越...

** [[https://time.geekbang.org/column/article/33112][104 | 高效沟通：好老板要善于提问]]

 永远不要给员工答案，要让员工给你答案，而且不要只给一个答案，一定要给多个答案。然后让他们比较这些答案，促...

** [[https://time.geekbang.org/column/article/41008][105 | 高效沟通：好好说话的艺术]]

 倾听老板会有一些出乎你的意料的发现，你要能了解老板背后的苦衷，那些才是最重要的。

** [[https://time.geekbang.org/column/article/41118][结束语 | 业精于勤，行成于思]]

 [本文音频由耗子叔倾情录制] 这个世界上的知识就像阳光和空气一样，根本不需要付费，就可以获得的，但问题是，...
